app/services/environments/create_default_for_application.rb

INSERT INTO "environments" ("application_id", "name", "default", "created_at", "updated_at", "deployment_target_id") VALUES (1, 'nonp', TRUE, '2026-05-26 17:34:06.640923', '2026-05-26 17:34:06.640923', 1) RETURNING "id"
---
    def self.call(application:)
      deployment_target = DeploymentTargets::SeedDefault.call

      application.environments.create!(
        name: DEFAULT_ENVIRONMENT_NAME,
        default: true,
        deployment_target: deployment_target
      )