app/services/repository_connections/create_connection.rb

INSERT INTO "repository_connections" ("created_at", "provider", "updated_at", "name", "scope", "project_id", "auth_username", "auth_secret_ciphertext", "validation_status", "endpoint_url") VALUES ('2026-05-26 22:01:11.849321', 'generic', '2026-05-26 22:01:11.849321', 'Serverlab Gitlab', 'global', NULL, 'srainville', '9iQ5BG3EcPZzD/c2ow==--MmEZGXBoI85VB0Pb--rJWCZrYuh5qjx5N/haKbdA==', 'pending', 'https://gitlab.serverlab.intra') RETURNING "id"
---
    def call
      return forbidden unless authorized?

      repository_connection = RepositoryConnection.new(
        name: params[:name],
        scope: scope,
        project: scoped_project,
        provider: params[:provider],
        endpoint_url: params[:endpoint_url],
        auth_username: params[:auth_username],
        ca_bundle: params[:ca_bundle].to_s,
        auth_secret_ciphertext: RepositoryConnections::CredentialCipher.encrypt(params[:auth_secret]),
        webhook_secret_ciphertext: encrypt_webhook_secret,
        validation_status: "pending"
      )

      if repository_connection.save