app/services/repository_connections/delete_connection.rb

    def call
      return forbidden unless authorized?

      if repository_connection.destroy
---
DELETE FROM "repository_connections" WHERE "repository_connections"."id" = 2