app/services/repository_connections/update_connection.rb

UPDATE "repository_connections" SET "updated_at" = '2026-05-26 23:09:36.386005', "auth_secret_ciphertext" = '8jWeVvLiMoo/QqNPV04RA995/J3hwramqIxAbCrpgholfUBKVUbOiruqcKdb2myqNJDSu08=--81VgiooUCCCnHFMl--ZQPgFaYKaN6Bwh4sBE0lUQ==', "validation_status" = 'pending' WHERE "repository_connections"."id" = 3
---
    def call
      return forbidden unless authorized?

      if repository_connection.update(update_attributes)