app/services/repository_connections/validate_endpoint_connection.rb

UPDATE "repository_connections" SET "updated_at" = '2026-05-26 23:09:38.594444', "validation_status" = 'validated' WHERE "repository_connections"."id" = 3
UPDATE "repository_connections" SET "updated_at" = '2026-05-26 22:13:40.175368', "validation_status" = 'validation_failed' WHERE "repository_connections"."id" = 2
---
    def call
      return forbidden unless authorized?

      validation_result = endpoint_validator.call(
        provider: repository_connection.provider,
        endpoint_url: repository_connection.endpoint_url,
        auth_username: repository_connection.auth_username,
        auth_secret: repository_connection.auth_secret,
        ca_bundle: repository_connection.ca_bundle
      )

      if validation_result.success?
        repository_connection.update!(validation_status: "validated")
        record_audit(status: "validated")
        Result.new(success?: true)
      else
        repository_connection.update!(validation_status: "validation_failed")