app/views/dashboard/show.html.erb

                  </td>
                  <td class="px-5 py-4 font-medium text-slate-700 dark:text-slate-200"><%= project.applications.size %></td>
---
SELECT "applications".* FROM "applications" WHERE "applications"."project_id" IN (2, 1)