app/controllers/admin/backend_targets_controller.rb

    def index
      @backend_targets = DeploymentTarget.order(:name)
---
SELECT "deployment_targets".* FROM "deployment_targets" ORDER BY "deployment_targets"."name" ASC

    def update
      backend_target = DeploymentTarget.find(params[:id])
---
SELECT "deployment_targets".* FROM "deployment_targets" WHERE "deployment_targets"."id" = 1 LIMIT 1

    def validate_connection
      backend_target = DeploymentTarget.find(params[:id])
---
SELECT "deployment_targets".* FROM "deployment_targets" WHERE "deployment_targets"."id" = 2 LIMIT 1