app/controllers/admin/project_applications_controller.rb

    def index
      @applications = Application.includes(:project).order(:name)
---
SELECT "applications".* FROM "applications" ORDER BY "applications"."name" ASC
SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (1, 3)