app/controllers/admin/projects_controller.rb

SELECT "projects".* FROM "projects" ORDER BY "projects"."name" ASC
---
    def index
      @projects = Project.order(:name)