app/controllers/admin/repository_connections_controller.rb

    def index
      @repository_connections = RepositoryConnection.global_scope.order(:name)
---
SELECT "repository_connections".* FROM "repository_connections" WHERE "repository_connections"."scope" = 'global' ORDER BY "repository_connections"."name" ASC

    def set_repository_connection
      @repository_connection = RepositoryConnection.global_scope.find(params[:id])
---
SELECT "repository_connections".* FROM "repository_connections" WHERE "repository_connections"."scope" = 'global' AND "repository_connections"."id" = 3 LIMIT 1