app/services/authentication/providers/local_password_provider.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'admin' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email" = 'admin@serverlab.intra' LIMIT 1
SELECT "external_identities".* FROM "external_identities" WHERE "external_identities"."user_id" = 2 AND "external_identities"."provider" = 'local' AND "external_identities"."external_subject" = 'admin@serverlab.intra' LIMIT 1
---
      def authenticate(username:, password:)
        normalized_username = username.to_s.strip.downcase
        user = User.find_by(username: normalized_username)
        return invalid_credentials unless user&.authenticate(password)

        user.external_identities.find_or_create_by!(provider: "local", external_subject: user.email)