app/services/applications/create_application.rb

SELECT 1 AS one FROM "project_memberships" WHERE "project_memberships"."project_id" = 1 AND "project_memberships"."user_id" = 1 LIMIT 1
---
    def authorized?
      ProjectMembership.exists?(project_id: project.id, user_id: actor.id)