app/services/applications/create_application.rb

INSERT INTO "applications" ("team_id", "name", "slug", "created_at", "updated_at", "project_id", "description", "runtime", "runtime_version", "runtime_option_id") VALUES (NULL, 'webster-ui-v2', 'webster-ui-v2', '2026-05-26 18:29:50.045115', '2026-05-26 18:29:50.045115', 1, '', 'ruby', '4', NULL) RETURNING "id"
INSERT INTO "applications" ("created_at", "description", "name", "project_id", "runtime", "runtime_option_id", "runtime_version", "slug", "team_id", "updated_at", "repository_connection_id", "repository_url") VALUES ('2026-05-26 23:16:06.246277', '', 'webster-ui-v2', 1, 'rails', NULL, '8', 'webster-ui-v2', NULL, '2026-05-26 23:16:06.246277', 3, 'https://gitlab.serverlab.intra/platform-engineering/talos.git') RETURNING "id"
INSERT INTO "repository_connections" ("application_id", "created_at", "default_branch", "provider", "repo_url", "updated_at") VALUES (1, '2026-05-26 21:31:36.559525', 'main', 'generic', 'https://gitlab.serverlab.intra/platform-engineering/talos.git', '2026-05-26 21:31:36.559525') RETURNING "id"
INSERT INTO "applications" ("created_at", "description", "name", "project_id", "runtime", "runtime_option_id", "runtime_version", "slug", "team_id", "updated_at", "repository_connection_id", "repository_url") VALUES ('2026-05-26 23:53:27.649445', '', 'Talos', 1, 'rails', NULL, '8', 'talos', NULL, '2026-05-26 23:53:27.649445', 3, 'https://gitlab.serverlab.intra/platform-engineering/talos.git') RETURNING "id"
---
    def call
      return Result.new(success?: false, error: :not_found, message: "Project not found") unless project
      return Result.new(success?: false, error: :forbidden, message: "Forbidden") unless authorized?

      runtime = selected_runtime
      return Result.new(success?: false, error: :validation_failed, message: "Runtime is not supported") unless runtime

      application = nil

      ActiveRecord::Base.transaction do
        application = Application.create!(
          project: project,
          name: app_params[:name],
          description: app_params[:description],
          runtime: runtime.name,
          runtime_version: runtime.version
        )

        RepositoryConnection.create!(
          application: application,
          provider: repository_params[:provider],
          repo_url: repository_params[:repo_url],
          default_branch: repository_params[:default_branch]
        )

        Environments::CreateDefaultForApplication.call(application: application)

        AuditEvents::Record.call(
          actor: actor,
          action: "application.created",
          auditable: application,
          metadata: {
            project_id: project.id,
            application_name: application.name,
            repo_provider: repository_params[:provider],
            runtime_name: runtime.name,
            runtime_version: runtime.version
          }
        )

SELECT 1 AS one FROM "project_memberships" WHERE "project_memberships"."project_id" = 1 AND "project_memberships"."user_id" = 1 LIMIT 1
---
    def authorized?
      ProjectMembership.exists?(project_id: project.id, user_id: actor.id)