app/services/audit_events/record.rb

    def self.call(actor:, team:, action:, auditable: nil, metadata: {})
      AuditEvent.create!(
        actor: actor,
        team: team,
        action: action,
        auditable: auditable,
        metadata: metadata,
        occurred_at: Time.current
      )
---
INSERT INTO "audit_events" ("team_id", "actor_id", "action", "auditable_type", "auditable_id", "metadata", "occurred_at", "created_at", "updated_at") VALUES (NULL, 1, 'user.registered', 'User', 1, '{"email":"shane.rainville@gmail.com","provider":"local"}', '2026-05-26 16:39:19.872862', '2026-05-26 16:39:19.876588', '2026-05-26 16:39:19.876588') RETURNING "id"