app/views/projects/index.html.erb

        <p class="mt-2 text-sm text-slate-600 dark:text-slate-300"><%= project.description.presence || "No description yet" %></p>
        <p class="mt-4 text-xs uppercase tracking-wide text-slate-500 dark:text-slate-400">Applications: <span class="font-semibold text-slate-700 dark:text-slate-200"><%= project.applications.count %></span></p>
---
SELECT "applications".* FROM "applications" WHERE "applications"."project_id" = 1
SELECT COUNT(*) FROM "applications" WHERE "applications"."project_id" = 1