app/views/projects/show.html.erb

SELECT COUNT(*) FROM "applications" WHERE "applications"."project_id" = 1
---
      <h2 class="text-xl font-semibold text-slate-900 dark:text-white">Applications</h2>
      <p class="text-sm text-slate-500 dark:text-slate-400"><%= pluralize(@applications.size, "application") %></p>

SELECT "environments".* FROM "environments" WHERE "environments"."application_id" = 1 AND "environments"."default" = TRUE LIMIT 1
---
                </td>
                <td class="px-6 py-4 text-slate-500 dark:text-slate-300"><%= application.environments.find_by(default: true)&.name || "—" %></td>