app/helpers/application_helper.rb

SELECT "environments".* FROM "environments" WHERE "environments"."application_id" = 3
SELECT "repository_connections".* FROM "repository_connections" WHERE "repository_connections"."application_id" = 3 LIMIT 1
---
  def application_state(application)
    return "Ready" if application.repository_connection.present? && application.environments.any? { |environment| environment.default? && environment.deployment_target.present? }

SELECT "applications".* FROM "applications" WHERE "applications"."project_id" = 1
---
  def project_summary_state(project)
    project.applications.all? { |application| application_state(application) == "Ready" } ? "Healthy" : "Needs attention"