app/services/deployment_targets/create_target.rb

INSERT INTO "deployment_targets" ("active", "backend_type", "created_at", "credential_reference", "description", "endpoint", "name", "updated_at", "validation_status") VALUES (TRUE, 'kubernetes', '2026-05-26 20:23:16.187628', 'helpme', 'Staging Tenant cluster', 'https://10.0.0.134:6443', 'stg-tenant1', '2026-05-26 20:23:16.187628', 'pending') RETURNING "id"
---
    def call
      return forbidden unless actor&.admin?

      backend_target = DeploymentTarget.new(params)
      backend_target.validation_status = "pending"

      if backend_target.save