app/services/deployment_targets/seed_default.rb

    def self.call
      target = DeploymentTarget.find_or_create_by!(name: DEFAULT_NAME)
      return target if target.description == DEFAULT_DESCRIPTION

      target.update!(description: DEFAULT_DESCRIPTION)
---
INSERT INTO "deployment_targets" ("active", "backend_type", "created_at", "credential_reference", "description", "endpoint", "name", "updated_at", "validation_status") VALUES (TRUE, 'kubernetes', '2026-05-26 19:58:33.067544', '', NULL, 'https://unconfigured.local', 'tenant-nonp', '2026-05-26 19:58:33.067544', 'pending') RETURNING "id"
SELECT "deployment_targets".* FROM "deployment_targets" WHERE "deployment_targets"."name" = 'tenant-nonp' LIMIT 1
UPDATE "deployment_targets" SET "description" = 'Default tenant non-production target', "updated_at" = '2026-05-26 17:34:06.636433' WHERE "deployment_targets"."id" = 1