app/views/project_applications/show.html.erb

SELECT "environments".* FROM "environments" WHERE "environments"."application_id" = 1
SELECT COUNT(*) FROM "environments" WHERE "environments"."application_id" = 1
---
        <div class="text-sm text-slate-500 dark:text-slate-400">Environments</div>
        <div class="mt-1 font-medium text-slate-900 dark:text-white"><%= pluralize(@application.environments.count, "environment") %></div>

SELECT "environments".* FROM "environments" WHERE "environments"."application_id" = 1 ORDER BY "environments"."name" ASC
---
      <div class="mt-4 grid gap-4 md:grid-cols-2">
        <% @application.environments.order(:name).each do |environment| %>