app/services/projects/create_project.rb

INSERT INTO "projects" ("name", "slug", "description", "created_at", "updated_at") VALUES ('Webster', 'webster', 'Financial management UI for the backend of Stike.', '2026-05-26 17:10:33.661408', '2026-05-26 17:10:33.661408') RETURNING "id"
INSERT INTO "project_memberships" ("project_id", "user_id", "role", "created_at", "updated_at") VALUES (1, 1, 'owner', '2026-05-26 17:10:33.668683', '2026-05-26 17:10:33.668683') RETURNING "id"
---
    def call
      project = nil

      ActiveRecord::Base.transaction do
        project = Project.create!(params)
        ProjectMembership.create!(project: project, user: actor, role: "owner")