app/services/authentication/bootstrap_default_admin.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'admin@runway.local' LIMIT 1
SELECT 1 AS one FROM "users" WHERE LOWER("users"."email") = LOWER('admin@runway.local') AND "users"."id" != 2 LIMIT 1
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "role", "updated_at", "username") VALUES ('2026-05-26 19:58:33.289353', 'admin@runway.local', 'Runway Admin', '$2a$12$37lvPQsmZD/v9rxax4tt.Onh5Z8zv/FV0nUBzaUpeF8N1dCFsMMNi', 'admin', '2026-05-26 19:58:33.289353', 'admin') RETURNING "id"
INSERT INTO "external_identities" ("created_at", "external_subject", "last_synced_at", "metadata", "provider", "updated_at", "user_id") VALUES ('2026-05-26 19:58:33.295250', 'admin@runway.local', NULL, '{}', 'local', '2026-05-26 19:58:33.295250', 2) RETURNING "id"
SELECT "external_identities".* FROM "external_identities" WHERE "external_identities"."user_id" = 2 AND "external_identities"."provider" = 'local' AND "external_identities"."external_subject" = 'admin@runway.local' LIMIT 1
SELECT 1 AS one FROM "users" WHERE LOWER("users"."email") = LOWER('admin@runway.local') LIMIT 1
---
    def call
      user = User.find_by(email: email)
      generated_password = nil
      created = false

      if user
        updates = { role: "admin", username: resolved_username }

        if password.present? || user.password_digest.blank?
          generated_password = resolved_password
          updates[:password] = generated_password
          updates[:password_confirmation] = generated_password
        end

        unless user.update(updates)
          return Result.new(success?: false, error: :validation_failed, message: user.errors.full_messages.to_sentence)
        end
      else
        generated_password = resolved_password
        user = User.new(
          name: name,
          email: email,
          username: resolved_username,
          role: "admin",
          password: generated_password,
          password_confirmation: generated_password
        )

        unless user.save
          return Result.new(success?: false, error: :validation_failed, message: user.errors.full_messages.to_sentence)
        end

        user.external_identities.find_or_create_by!(provider: "local", external_subject: user.email)
        created = true
      end

      AuditEvents::Record.call(
        actor: user,
        action: created ? "user.admin_bootstrapped" : "user.admin_bootstrap_verified",
        auditable: user,
        metadata: {
          email: user.email,
          generated_password: generated_password.present?
        }
      )