app/services/authentication/register_user.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "role", "updated_at", "username") VALUES ('2026-05-26 19:57:40.269300', 'shane.rainville@gmail.com', 'Shane Rainville', '$2a$12$A82m3DmTkMDXCU.UWWsqRexbzHogIDDM2Pd70MKwitQUS8U1AgAIq', 'member', '2026-05-26 19:57:40.269300', 'srainville') RETURNING "id"
INSERT INTO "external_identities" ("user_id", "provider", "external_subject", "metadata", "last_synced_at", "created_at", "updated_at") VALUES (1, 'local', 'shane.rainville@gmail.com', '{}', NULL, '2026-05-26 16:39:19.871189', '2026-05-26 16:39:19.871189') RETURNING "id"
---
    def call
      user = User.new(params.slice(:name, :email, :username, :password, :password_confirmation))

      if user.save
        user.external_identities.create!(provider: "local", external_subject: user.email)