app/controllers/applications_controller.rb

SELECT "applications".* FROM "applications" WHERE "applications"."team_id" IN (?, ?)  [["team_id", 298486374], ["team_id", 980190962]]
SELECT "teams".* FROM "teams" INNER JOIN "memberships" ON "teams"."id" = "memberships"."team_id" WHERE "memberships"."user_id" = ?  [["user_id", 980190962]]
---
  def index
    applications = current_user.teams.includes(:applications).flat_map(&:applications)

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
  def create
    team = Team.find_by(id: application_params[:team_id])