app/controllers/application_environments_controller.rb

SELECT "projects".* FROM "projects" INNER JOIN "project_memberships" ON "projects"."id" = "project_memberships"."project_id" WHERE "project_memberships"."user_id" = 1 AND "projects"."id" = 1 LIMIT 1
---
  def set_project
    @project = current_user.projects.find_by(id: params[:project_id])

SELECT "applications".* FROM "applications" WHERE "applications"."project_id" = 1 AND "applications"."id" = 1 LIMIT 1
---
  def set_application
    return unless @project

    @application = @project.applications.find_by(id: params[:application_id])

SELECT "environments".* FROM "environments" WHERE "environments"."application_id" = 1 AND "environments"."id" = 1 LIMIT 1
---
  def set_environment
    return unless @application

    @environment = @application.environments.find_by(id: params[:id])