app/controllers/application_controller.rb

  def current_user
    @current_user ||= begin
      session_user_id = session[:user_id]
      header_user_id = request.headers["X-Runway-User-Id"]
      user_id = session_user_id.presence || header_user_id.presence
      User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1