app/controllers/dashboard_controller.rb

SELECT "environments".* FROM "environments" WHERE "environments"."application_id" IN (2, 1)
SELECT "projects".* FROM "projects" INNER JOIN "project_memberships" ON "projects"."id" = "project_memberships"."project_id" WHERE "project_memberships"."user_id" = 1 ORDER BY "projects"."name" ASC
SELECT "repository_connections".* FROM "repository_connections" WHERE "repository_connections"."application_id" IN (2, 1)
---
  def show
    @projects = Project
      .left_joins(:project_memberships)
      .where("projects.public = ? OR project_memberships.user_id = ?", true, current_user.id)
      .includes(applications: [:environments, :repository_connection])
      .distinct
      .order(:name)