app/controllers/project_repository_connections_controller.rb

  def index
    @repository_connections = @project.repository_connections.order(:name)
---
SELECT "repository_connections".* FROM "repository_connections" WHERE "repository_connections"."project_id" = 1 ORDER BY "repository_connections"."name" ASC

  def set_project
    @project = current_user.projects.find_by(id: params[:project_id])
---
SELECT "projects".* FROM "projects" INNER JOIN "project_memberships" ON "projects"."id" = "project_memberships"."project_id" WHERE "project_memberships"."user_id" = 1 AND "projects"."id" = 1 LIMIT 1

  def set_repository_connection
    @repository_connection = @project.repository_connections.find(params[:id])
---
SELECT "repository_connections".* FROM "repository_connections" WHERE "repository_connections"."project_id" = 1 AND "repository_connections"."id" = 1 LIMIT 1