app/controllers/project_applications_controller.rb

SELECT "projects".* FROM "projects" INNER JOIN "project_memberships" ON "projects"."id" = "project_memberships"."project_id" WHERE "project_memberships"."user_id" = 1 AND "projects"."id" = 1 LIMIT 1
---
  def set_project
    @project = current_user.projects.find_by(id: params[:project_id])

SELECT "applications".* FROM "applications" WHERE "applications"."project_id" = 1 AND "applications"."id" = 3 LIMIT 1
---
  def set_application
    @application = @project.applications.find_by(id: params[:id])