app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" INNER JOIN "project_memberships" ON "projects"."id" = "project_memberships"."project_id" WHERE "project_memberships"."user_id" = 1 ORDER BY "projects"."name" ASC
---
  def index
    @projects = current_user.projects.order(:name)

SELECT "applications".* FROM "applications" WHERE "applications"."project_id" = 1 ORDER BY "applications"."name" ASC
SELECT "environments".* FROM "environments" WHERE "environments"."application_id" IN (2, 1)
SELECT "repository_connections".* FROM "repository_connections" WHERE "repository_connections"."application_id" IN (2, 1)
---
  def show
    @applications = @project.applications.includes(:repository_connection, :environments).order(:name)

SELECT "projects".* FROM "projects" INNER JOIN "project_memberships" ON "projects"."id" = "project_memberships"."project_id" WHERE "project_memberships"."user_id" = 1 AND "projects"."id" = 1 LIMIT 1
---
  def set_project
    @project = current_user.projects.find_by(id: params[:id])